// 身份证号
export const id_number = /^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}[\dXx]$/

// 身份证号(1代,15位数字)
export const id_number_1st = /^[1-9]\d{7}(?:0\d|10|11|12)(?:0[1-9]|[1-2][\d]|30|31)\d{3}$/

// 手机号(严谨型)
export const phone_rigor = /^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[189]))\d{8}$/
// 手机号(宽松), 只要是13,14,15,16,17,18,19开头即可
export const phone = /^(?:(?:\+|00)86)?1[3-9]\d{9}$/
// 手机号(最宽松), 只要是1开头即可, 如果你的手机号是用来接收短信, 优先建议选择这一条
export const phone_loose = /^(?:(?:\+|00)86)?1\d{10}$/

// email
export const email = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/

// 座机/电话(国内),如: 0300-86868686
export const telephone = /^(?:(?:\d{3}-)?\d{8}|^(?:\d{4}-)?\d{7,8})(?:-\d+)?$/

// 护照
export const passport = /(^[EeKkGgDdSsPpHh]\d{8}$)|(^(([Ee][a-fA-F])|([DdSsPp][Ee])|([Kk][Jj])|([Mm][Aa])|(1[45]))\d{7}$)/

// QQ号格式
export const qq = /^[1-9][0-9]{4,10}$/

// 微信号(wx)，6至20位，以字母开头，字母，数字，减号，下划线
export const wechat_number = /^[a-zA-Z][-_a-zA-Z0-9]{5,19}$/

// 邮政编码(中国)
export const zip_code = /^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\d{4}$/

// 手机机身码(IMEI)
export const IMEI = /^\d{15,17}$/

// 火车车次
export const train_number = /^[GCDZTSPKXLY1-9]\d{1,4}$/
